In [10]:
import pandas as pd
df = pd.DataFrame({
    'city':['부산','부산','부산','부산','서울', '서울','서울'],
    'fruits':['apple','orange','banana','banana','apple','apple','banana'],
    'price':[100,200,250,300,150,200,400],
    'quantity':[1,2,3,4,5,6,7]
})

In [23]:
df

  city  fruits  price  quantity
0   부산   apple    100         1
1   부산  orange    200         2
2   부산  banana    250         3
3   부산  banana    300         4
4   서울   apple    150         5
5   서울   apple    200         6
6   서울  banana    400         7

In [29]:
df_city=df.groupby('city')
df_city.mean()

C:\Users\popoy\AppData\Local\Temp\ipykernel_9940\3635636042.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df_city.mean()

      price  quantity
city
부산    212.5       2.5
서울    250.0       6.0

In [30]:
df.groupby(['city','fruits']).mean()

             price  quantity
city fruits
부산   apple   100.0       1.0
     banana  275.0       3.5
     orange  200.0       2.0
서울   apple   175.0       5.5
     banana  400.0       7.0

In [45]:
import numpy as np
df_city_busan = df_city.get_group('부산')
df_city_busan

  city  fruits  price  quantity
0   부산   apple    100         1
1   부산  orange    200         2
2   부산  banana    250         3
3   부산  banana    300         4

In [46]:
max = df_city_busan['price'].max()
max

300

In [47]:
df_city_busan[df_city_busan['price']==max]

  city  fruits  price  quantity
3   부산  banana    300         4

In [49]:
df_city.agg({'price':np.max,'quantity':np.min})

      price  quantity
city
부산      300         1
서울      400         5